cmsis-svd/cmsis-svd/data/Atmel/ATSAME53J20A.svd
            <cluster>
               <dim>32</dim>
               <dimIncrement>0x10</dimIncrement>
               <name>CHANNEL[%s]</name>
               <description/>
               <addressOffset>0x40</addressOffset>
               <register>
                  <name>CHCTRLA</name>
                  <description>Channel n Control A</description>
                  <addressOffset>0x0</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>SWRST</name>
                        <description>Channel Software Reset</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ENABLE</name>
                        <description>Channel Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RUNSTDBY</name>
                        <description>Channel Run in Standby</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TRIGSRC</name>
                        <description>Trigger Source</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>7</bitWidth>
                        <enumeratedValues>
                           <name>TRIGSRCSelect</name>
                           <enumeratedValue>
                              <name>DISABLE</name>
                              <description>Only software/event triggers</description>
                              <value>0</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>TRIGACT</name>
                        <description>Trigger Action</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>TRIGACTSelect</name>
                           <enumeratedValue>
                              <name>BLOCK</name>
                              <description>One trigger required for each block transfer</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>BURST</name>
                              <description>One trigger required for each burst transfer</description>
                              <value>2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TRANSACTION</name>
                              <description>One trigger required for each transaction</description>
                              <value>3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>BURSTLEN</name>
                        <description>Burst Length</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>4</bitWidth>
                        <enumeratedValues>
                           <name>BURSTLENSelect</name>
                           <enumeratedValue>
                              <name>SINGLE</name>
                              <description>Single-beat burst length</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>2BEAT</name>
                              <description>2-beats burst length</description>
                              <value>1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>3BEAT</name>
                              <description>3-beats burst length</description>
                              <value>2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>4BEAT</name>
                              <description>4-beats burst length</description>
                              <value>3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>5BEAT</name>
                              <description>5-beats burst length</description>
                              <value>4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>6BEAT</name>
                              <description>6-beats burst length</description>
                              <value>5</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>7BEAT</name>
                              <description>7-beats burst length</description>
                              <value>6</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>8BEAT</name>
                              <description>8-beats burst length</description>
                              <value>7</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>9BEAT</name>
                              <description>9-beats burst length</description>
                              <value>8</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>10BEAT</name>
                              <description>10-beats burst length</description>
                              <value>9</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>11BEAT</name>
                              <description>11-beats burst length</description>
                              <value>10</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>12BEAT</name>
                              <description>12-beats burst length</description>
                              <value>11</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>13BEAT</name>
                              <description>13-beats burst length</description>
                              <value>12</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>14BEAT</name>
                              <description>14-beats burst length</description>
                              <value>13</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>15BEAT</name>
                              <description>15-beats burst length</description>
                              <value>14</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>16BEAT</name>
                              <description>16-beats burst length</description>
                              <value>15</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>THRESHOLD</name>
                        <description>FIFO Threshold</description>
                        <bitOffset>28</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>THRESHOLDSelect</name>
                           <enumeratedValue>
                              <name>1BEAT</name>
                              <description>Destination write starts after each beat source address read</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>2BEATS</name>
                              <description>Destination write starts after 2-beats source address read</description>
                              <value>1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>4BEATS</name>
                              <description>Destination write starts after 4-beats source address read</description>
                              <value>2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>8BEATS</name>
                              <description>Destination write starts after 8-beats source address read</description>
                              <value>3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CHCTRLB</name>
                  <description>Channel n Control B</description>
                  <addressOffset>0x4</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>CMD</name>
                        <description>Software Command</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>CMDSelect</name>
                           <enumeratedValue>
                              <name>NOACT</name>
                              <description>No action</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SUSPEND</name>
                              <description>Channel suspend operation</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>RESUME</name>
                              <description>Channel resume operation</description>
                              <value>0x2</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CHPRILVL</name>
                  <description>Channel n Priority Level</description>
                  <addressOffset>0x5</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>PRILVL</name>
                        <description>Channel Priority Level</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>PRILVLSelect</name>
                           <enumeratedValue>
                              <name>LVL0</name>
                              <description>Channel Priority Level 0 (Lowest Level)</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>LVL1</name>
                              <description>Channel Priority Level 1</description>
                              <value>1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>LVL2</name>
                              <description>Channel Priority Level 2</description>
                              <value>2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>LVL3</name>
                              <description>Channel Priority Level 3 (Highest Level)</description>
                              <value>3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CHEVCTRL</name>
                  <description>Channel n Event Control</description>
                  <addressOffset>0x6</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>EVACT</name>
                        <description>Channel Event Input Action</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>3</bitWidth>
                        <enumeratedValues>
                           <name>EVACTSelect</name>
                           <enumeratedValue>
                              <name>NOACT</name>
                              <description>No action</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TRIG</name>
                              <description>Transfer and periodic transfer trigger</description>
                              <value>1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>CTRIG</name>
                              <description>Conditional transfer trigger</description>
                              <value>2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>CBLOCK</name>
                              <description>Conditional block transfer</description>
                              <value>3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SUSPEND</name>
                              <description>Channel suspend operation</description>
                              <value>4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>RESUME</name>
                              <description>Channel resume operation</description>
                              <value>5</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SSKIP</name>
                              <description>Skip next block suspend action</description>
                              <value>6</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>INCPRI</name>
                              <description>Increase priority</description>
                              <value>7</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>EVOMODE</name>
                        <description>Channel Event Output Mode</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>EVOMODESelect</name>
                           <enumeratedValue>
                              <name>DEFAULT</name>
                              <description>Block event output selection. Refer to BTCTRL.EVOSEL for available selections.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TRIGACT</name>
                              <description>Ongoing trigger action</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>EVIE</name>
                        <description>Channel Event Input Enable</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EVOE</name>
                        <description>Channel Event Output Enable</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CHINTENCLR</name>
                  <description>Channel n Interrupt Enable Clear</description>
                  <addressOffset>0xC</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>TERR</name>
                        <description>Channel Transfer Error Interrupt Enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TCMPL</name>
                        <description>Channel Transfer Complete Interrupt Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SUSP</name>
                        <description>Channel Suspend Interrupt Enable</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CHINTENSET</name>
                  <description>Channel n Interrupt Enable Set</description>
                  <addressOffset>0xD</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>TERR</name>
                        <description>Channel Transfer Error Interrupt Enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TCMPL</name>
                        <description>Channel Transfer Complete Interrupt Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SUSP</name>
                        <description>Channel Suspend Interrupt Enable</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CHINTFLAG</name>
                  <description>Channel n Interrupt Flag Status and Clear</description>
                  <addressOffset>0xE</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>TERR</name>
                        <description>Channel Transfer Error</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TCMPL</name>
                        <description>Channel Transfer Complete</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SUSP</name>
                        <description>Channel Suspend</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CHSTATUS</name>
                  <description>Channel n Status</description>
                  <addressOffset>0xF</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>PEND</name>
                        <description>Channel Pending</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>BUSY</name>
                        <description>Channel Busy</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>FERR</name>
                        <description>Channel Fetch Error</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CRCERR</name>
                        <description>Channel CRC Error</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
